/* No comment provided by engineer. */
"%1.0lf seconds" = "%1.0lf sekuntia";

/* No comment provided by engineer. */
"%i hours" = "%i tuntia";

/* No comment provided by engineer. */
"%i minutes" = "%i minuuttia";

/* No comment provided by engineer. */
"1 day" = "1 päivä";

/* No comment provided by engineer. */
"1 hour" = "1 tunti";

/* No comment provided by engineer. */
"1 minute" = "1 minuutti";

/* No comment provided by engineer. */
"1 second" = "1 sekunti";

/* No comment provided by engineer. */
"1 week" = "1 viikko";

/* No comment provided by engineer. */
"<<Attachment>>" = "<<Liite>>";

/* clear all marks contextual menu item title */
"Clear All Marks" = "Clear All Marks";

/* clear marks from here up contextual menu */
"Clear Marks from Here Down" = "Clear Marks from Here Down";

/* clear marks from here left contextual menu */
"Clear Marks from Here Left" = "Clear Marks from Here Left";

/* clear marks from here right contextual menu */
"Clear Marks from Here Right" = "Clear Marks from Here Right";

/* clear marks from here up contextual menu */
"Clear Marks from Here Up" = "Clear Marks from Here Up";

/* Copy the link to the clipboard */
"Copy Link" = "Kopio linkki";

/* No comment provided by engineer. */
"Image Picker" = "Kuvanpoimija";

/* No comment provided by engineer. */
"Invalid Input" = "Virheellinen syöttö";

/* jump to the mark where the last content the user saw ends */
"Jump to Focus Mark" = "Jump to Focus Mark";

/* jump to next mark contextual menu */
"Jump to Next Mark" = "Jump to Next Mark";

/* jump to previous mark contextual menu */
"Jump to Previous Mark" = "Jump to Previous Mark";

/* No comment provided by engineer. */
"OK" = "Ok";

/* No comment provided by engineer. */
"Picture" = "Kuva";

/* No comment provided by engineer. */
"Select Image" = "Valitse kuva";

/* Strings the code localizes which had never been extracted; English value = key. */
"%li days" = "%li päivää";
"%li hours" = "%li tuntia";
"%li minutes" = "%li minuuttia";
"%li weeks" = "%li viikkoa";
